Diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ДнейОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	ПроверкаЗаполненияДанных(Элементы.ОтпускаСотрудников.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполненияДанных(ТекДанные)
	
	Если Не ЗначениеЗаполнено(ТекДанные.ДатаНачала) Или Не ЗначениеЗаполнено(ТекДанные.ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
		
	ЗаполнитьНаСервере()
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	УсловноеОформление.Элементы.Очистить();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	МассивСотрудников = ОбработкаОбъект.ПриИзмененииДанных();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");   
	
	Если ЗначениеЗаполнено(МассивСотрудников) Тогда 
		
		Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
			
			УстановитьУсловноеОформление(МассивСотрудников);     
			
		КонецЦикла;   
		
		ТекстСообщения = "У выделенных сотрудников общая продолжительность отпуска более 28 календарных дней. ";
		Для Каждого Строка Из МассивСотрудников Цикл
			
			ТекстСообщения = ТекстСообщения + Символы.ПС + Строка.Сотрудник + " превышено на: " + (Строка.Дней - 28) + ".";
			
		КонецЦикла;
				
		Сообщения = Новый СообщениеПользователю;  
		Сообщения.Текст = ТекстСообщения;
		Сообщения.Сообщить();

	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Процедура УстановитьУсловноеОформление(МассивСотрудников)
	
	
	Для Каждого Элемент из МассивСотрудников Цикл
		
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Использование = Истина; 
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
		
		ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник"); 
		ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;	 
		ЭлементУсловия.ПравоеЗначение = Элемент.Сотрудник;
		ЭлементУсловия.Использование = Истина;
		
		ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления1 = ЭлементОформления.Поля.Элементы.Добавить();  
		ПолеОформления2 = ЭлементОформления.Поля.Элементы.Добавить();  
		ПолеОформления3 = ЭлементОформления.Поля.Элементы.Добавить();  
		ПолеОформления4 = ЭлементОформления.Поля.Элементы.Добавить();  
		
		ПолеОформления1.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковНомерСтроки");
		ПолеОформления2.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");
		ПолеОформления3.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаНачала");
		ПолеОформления4.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаОкончания");
		
		ПолеОформления1.Использование = Истина;
		ПолеОформления2.Использование = Истина;
		ПолеОформления3.Использование = Истина;
		ПолеОформления4.Использование = Истина;     
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	МассивДанных = Новый Массив;
	
	МассивДанных.Добавить(Объект.Год);
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		ДанныеСтроки = Новый Структура;
		
		ДанныеСтроки.Вставить("Сотрудник", Строка.Сотрудник);
		ДанныеСтроки.Вставить("ДатаНачала", Строка.ДатаНачала);
		ДанныеСтроки.Вставить("ДатаОкончания", Строка.ДатаОкончания);

		МассивДанных.Добавить(ДанныеСтроки);	
		
	КонецЦикла;
	
	Адрес = ПоместитьВоВременноеХранилище(МассивДанных, УникальныйИдентификатор);
	
	Парам = Новый Структура;
	Парам.Вставить("Адрес", Адрес); 
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", Парам, ЭтотОбъект, УникальныйИдентификатор);	 
	
КонецПроцедуры
